<a href="https://colab.research.google.com/github/FarrelAD/Sinau-Mesin/blob/main/notebooks/jobsheet-03/practicum-02.ipynb" target="_blank">
    <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Preparation

In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder, StandardScaler

# 1. Load Data

In [2]:
df = pd.read_csv('../../datasets/titanic-dataset-fixed.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,DECK,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,DECK,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,DECK,S

# 2. Pre Processing Encoding Sex

In [3]:
df['Sex'] = df['Sex'].map({'male': 1, 'female': 0})
df[['Sex']].head()

   Sex
0    1
1    0
2    0
3    0
4    1

# 3. Pre Processing Encoding "Cabin"

In [4]:
df['Cabin'] = df['Cabin'].fillna('Unknown')
df[['Cabin']].head()

  Cabin
0  DECK
1   C85
2  DECK
3  C123
4  DECK

In [5]:

df['Cabin'] = df['Cabin'].apply(lambda x: x[0] if x != 'Unknown' else 'U')
df[['Cabin']].head()

  Cabin
0     D
1     C
2     D
3     C
4     D

# 4. Data Imputation

In [6]:
df['Age'] = df[['Age']].fillna(df['Age'].median())
df[['Age']].head(10)

         Age
0  22.000000
1  38.000000
2  26.000000
3  35.000000
4  35.000000
5  29.699118
6  54.000000
7   2.000000
8  27.000000
9  14.000000

# 5. Pre Processing Standardization

In [7]:
scaler = StandardScaler()
df['Age'] = scaler.fit_transform(df[['Age']])
df[['Age']].head(10)

        Age
0 -0.592481
1  0.638789
2 -0.284663
3  0.407926
4  0.407926
5  0.000000
6  1.870059
7 -2.131568
8 -0.207709
9 -1.208115

# 6. Result After Preprocessing

In [9]:
df[['Sex', 'Cabin', 'Age']].head(10)

   Sex Cabin       Age
0    1     D -0.592481
1    0     C  0.638789
2    0     D -0.284663
3    0     C  0.407926
4    1     D  0.407926
5    1     D  0.000000
6    1     E  1.870059
7    1     D -2.131568
8    0     D -0.207709
9    0     D -1.208115

# 7. Feature Selection

In [11]:
df = df[['Survived', 'Pclass', 'Age', 'Sex', 'Cabin']]
df.head(10)

   Survived  Pclass       Age  Sex Cabin
0         0       3 -0.592481    1     D
1         1       1  0.638789    0     C
2         1       3 -0.284663    0     D
3         1       1  0.407926    0     C
4         0       3  0.407926    1     D
5         0       3  0.000000    1     D
6         0       1  1.870059    1     E
7         0       3 -2.131568    1     D
8         1       3 -0.207709    0     D
9         1       2 -1.208115    0     D